#!/bin/bash

#===========================================================================
# Nome     : 02_instalarPacotesR.sh
#            Copyright (c) 2023 Ícaro Vidal Freire 
#---------------------------------------------------------------------------
# Descrição: 
# Licença  : The MIT License (MIT)
# Versão   : 0.1.0
#---------------------------------------------------------------------------
# Como usar: 
#===========================================================================

# criando função --------------------------------------------------------->>
instalar_pacotes_r(){
  echo 
  echo "##### Instalando pacotes R (vai demorar!) =================================="
  echo 
  Rscript ../scripts_R/pacotes-r_instalar.R
  echo 
  echo "------- FIM (instalar_pacotes_r)"
}
#-------------------------------------------------------------------------<<

# executando a função ------------------------------------------------------
instalar_pacotes_r
